; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v2)
		(pred_5 ?v7)
		(pred_1 ?v6)
		(pred_2 ?v6)
		(pred_3 ?v7 ?v6)
		(pred_4)
		(pred_6 ?v7))

   (:action op_2
       :parameters  (?v8 ?v3)
       :precondition (and (not-eq ?v8 ?v3) 
                          (pred_1 ?v8) (pred_1 ?v3) (pred_2 ?v8))
       :effect (and  (pred_2 ?v3)
		     (not (pred_2 ?v8))))


   (:action op_1
       :parameters (?v5 ?v1)
       :precondition  (and  (pred_5 ?v5) (pred_1 ?v1)
			    (pred_3 ?v5 ?v1) (pred_2 ?v1) (pred_4))
       :effect (and (pred_6 ?v5)
		    (not (pred_3 ?v5 ?v1)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v5  ?v1)
       :precondition  (and  (pred_5 ?v5) (pred_1 ?v1)
			    (pred_6 ?v5) (pred_2 ?v1))
       :effect (and (pred_3 ?v5 ?v1)
		    (pred_4)
		    (not (pred_6 ?v5)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_05 obj_02 obj_01 obj_03 obj_06 
          obj_04 obj_07 
)
(:init
(pred_1 obj_05)
(pred_1 obj_02)
(pred_1 obj_01)
(pred_1 obj_03)
(pred_1 obj_06)
(pred_5 obj_04)
(pred_5 obj_07)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(pred_4)
(pred_3 obj_04 obj_06)
(pred_3 obj_07 obj_06)
(pred_2 obj_02)
)
(:goal
(and
(pred_3 obj_04 obj_01)
(pred_3 obj_07 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_04 obj_01) (pred_2 obj_05))
    (sometime-before  (pred_3 obj_07 obj_03) (pred_2 obj_05))
  )
)
)

; plan
1. (op_2 obj_02 obj_06)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_06)
   goals met: 0 of 2
2. (op_1 obj_07 obj_06)
   deleted: (pred_3 obj_07 obj_06) (pred_4)
   added: (pred_6 obj_07)
   goals met: 0 of 2
3. (op_2 obj_06 obj_01)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_01)
   goals met: 0 of 2
4. (op_3 obj_07 obj_01)
   deleted: (pred_6 obj_07)
   added: (pred_3 obj_07 obj_01) (pred_4)
   goals met: 0 of 2
5. (op_2 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_06)
   goals met: 0 of 2
6. (op_1 obj_04 obj_06)
   deleted: (pred_3 obj_04 obj_06) (pred_4)
   added: (pred_6 obj_04)
   goals met: 0 of 2
7. (op_2 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 0 of 2
8. (op_3 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_3 obj_04 obj_05) (pred_4)
   goals met: 0 of 2
9. (op_2 obj_05 obj_01)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_01)
   goals met: 0 of 2
10. (op_1 obj_07 obj_01)
   deleted: (pred_3 obj_07 obj_01) (pred_4)
   added: (pred_6 obj_07)
   goals met: 0 of 2
11. (op_2 obj_01 obj_03)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_03)
   goals met: 0 of 2
12. (op_3 obj_07 obj_03)
   deleted: (pred_6 obj_07)
   added: (pred_3 obj_07 obj_03) (pred_4)
   goals met: 1 of 2
13. (op_2 obj_03 obj_05)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_05)
   goals met: 1 of 2
14. (op_1 obj_04 obj_05)
   deleted: (pred_3 obj_04 obj_05) (pred_4)
   added: (pred_6 obj_04)
   goals met: 1 of 2
15. (op_2 obj_05 obj_01)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_01)
   goals met: 1 of 2
16. (op_3 obj_04 obj_01)
   deleted: (pred_6 obj_04)
   added: (pred_3 obj_04 obj_01) (pred_4)
   goals met: 2 of 2
